/*
 *  SPDX-FileCopyrightText: 2023 CSSlayer <wengxt@gmail.com>
 *
 *  SPDX-License-Identifier: GPL-2.0-or-later
 */
#include "style_file.h"
#include "testdir.h"
#include <cstddef>
#include <fcitx-utils/log.h>
#include <string>
#include <string_view>
#include <tuple>
#include <vector>

namespace {

void test101kana() {

    StyleFile style;
    style.load(TESTING_SOURCE_DIR "/profile/101kana.sty");
    FCITX_ASSERT(style.title() == "101英語キーボード用かな配列");
    constexpr std::string_view section = "KanaTable/FundamentalTable";
    auto keys = style.getKeyList(section);
    FCITX_ASSERT(keys);
    std::vector<std::tuple<std::string, std::vector<std::string>>>
        expectedValues = {
            {"~", {"ろ"}},     {"1", {"ぬ"}},     {"2", {"", "ふ"}},
            {"3", {"あ"}},     {"4", {"う"}},     {"5", {"え"}},
            {"6", {"お"}},     {"7", {"や"}},     {"8", {"ゆ"}},
            {"9", {"よ"}},     {"0", {"わ"}},     {"-", {"", "ほ"}},
            {"=", {"", "へ"}}, {"q", {"", "た"}}, {"w", {"", "て"}},
            {"e", {"い"}},     {"r", {"", "す"}}, {"t", {"", "か"}},
            {"y", {"ん"}},     {"u", {"な"}},     {"i", {"に"}},
            {"o", {"ら"}},     {"p", {"", "せ"}}, {"[", {"゛"}},
            {"]", {"゜"}},     {"\\", {"む"}},    {"a", {"", "ち"}},
            {"s", {"", "と"}}, {"d", {"", "し"}}, {"f", {"", "は"}},
            {"g", {"", "き"}}, {"h", {"", "く"}}, {"j", {"ま"}},
            {"k", {"の"}},     {"l", {"り"}},     {";", {"れ"}},
            {"'", {"", "け"}}, {"z", {"", "つ"}}, {"x", {"", "さ"}},
            {"c", {"", "そ"}}, {"v", {"", "ひ"}}, {"b", {"", "こ"}},
            {"n", {"み"}},     {"m", {"も"}},     {",", {"ね"}},
            {".", {"る"}},     {"/", {"め"}},     {"`", {"ろ"}},
            {"!", {"ぬ"}},     {"@", {"", "ふ"}}, {"#", {"ぁ"}},
            {"$", {"ぅ"}},     {"%", {"ぇ"}},     {"^", {"ぉ"}},
            {"&", {"ゃ"}},     {"*", {"ゅ"}},     {"(", {"ょ"}},
            {")", {"を"}},     {"_", {"ー"}},     {"+", {"ゑ"}},
            {"Q", {"", "た"}}, {"W", {"", "て"}}, {"E", {"ぃ"}},
            {"R", {"", "す"}}, {"T", {"ヵ"}},     {"Y", {"ん"}},
            {"U", {"な"}},     {"I", {"に"}},     {"O", {"ら"}},
            {"P", {"", "せ"}}, {"{", {"「"}},     {"}", {"」"}},
            {"|", {"む"}},     {"A", {"", "ち"}}, {"S", {"", "と"}},
            {"D", {"", "し"}}, {"F", {"", "ゎ"}}, {"G", {"", "き"}},
            {"H", {"", "く"}}, {"J", {"ま"}},     {"K", {"の"}},
            {"L", {"り"}},     {":", {"れ"}},     {"\"", {"ヶ"}},
            {"Z", {"っ"}},     {"X", {"", "さ"}}, {"C", {"", "そ"}},
            {"V", {"", "ゐ"}}, {"B", {"", "こ"}}, {"N", {"み"}},
            {"M", {"も"}},     {"?", {"・"}},

        };
    FCITX_ASSERT(expectedValues.size() == keys->size());
    for (size_t i = 0; i < keys->size(); i++) {
        FCITX_ASSERT((*keys)[i] == std::get<0>(expectedValues[i]))
            << (*keys)[i] << " " << expectedValues[i];
        auto values = style.getStringArray(section, (*keys)[i]);
        FCITX_ASSERT(values);
        FCITX_ASSERT(*values == std::get<1>(expectedValues[i]));
    }
}

void testwnn() {

    StyleFile style;
    style.load(TESTING_SOURCE_DIR "/profile/wnn.sty");
    FCITX_ASSERT(style.title() == "Wnn");
    constexpr std::string_view section = "RomajiTable/FundamentalTable";
    auto keys = style.getKeyList(section);
    FCITX_ASSERT(keys);
    std::vector<std::tuple<std::string, std::vector<std::string>>>
        expectedValues = {
            {"-", {"ー"}},     {"z.", {"…"}},     {"z-", {"〜"}},
            {"a", {"あ"}},     {"i", {"い"}},     {"u", {"う"}},
            {"e", {"え"}},     {"o", {"お"}},     {"ka", {"か"}},
            {"ki", {"き"}},    {"ku", {"く"}},    {"ke", {"け"}},
            {"ko", {"こ"}},    {"kya", {"きゃ"}}, {"kyi", {"きぃ"}},
            {"kyu", {"きゅ"}}, {"kye", {"きぇ"}}, {"kyo", {"きょ"}},
            {"sa", {"さ"}},    {"si", {"し"}},    {"su", {"す"}},
            {"se", {"せ"}},    {"so", {"そ"}},    {"sya", {"しゃ"}},
            {"syi", {"しぃ"}}, {"syu", {"しゅ"}}, {"sye", {"しぇ"}},
            {"syo", {"しょ"}}, {"sha", {"しゃ"}}, {"shi", {"し"}},
            {"shu", {"しゅ"}}, {"she", {"しぇ"}}, {"sho", {"しょ"}},
            {"ta", {"た"}},    {"ti", {"ち"}},    {"tu", {"つ"}},
            {"te", {"て"}},    {"to", {"と"}},    {"tya", {"ちゃ"}},
            {"tyi", {"てぃ"}}, {"tyu", {"ちゅ"}}, {"tye", {"ちぇ"}},
            {"tyo", {"ちょ"}}, {"tha", {"てゃ"}}, {"thi", {"てぃ"}},
            {"thu", {"てゅ"}}, {"the", {"てぇ"}}, {"tho", {"てょ"}},
            {"tsu", {"つ"}},   {"cha", {"ちゃ"}}, {"chi", {"ち"}},
            {"chu", {"ちゅ"}}, {"che", {"ちぇ"}}, {"cho", {"ちょ"}},
            {"na", {"な"}},    {"ni", {"に"}},    {"nu", {"ぬ"}},
            {"ne", {"ね"}},    {"no", {"の"}},    {"nya", {"にゃ"}},
            {"nyi", {"にぃ"}}, {"nyu", {"にゅ"}}, {"nye", {"にぇ"}},
            {"nyo", {"にょ"}}, {"ha", {"は"}},    {"hi", {"ひ"}},
            {"hu", {"ふ"}},    {"he", {"へ"}},    {"ho", {"ほ"}},
            {"hya", {"ひゃ"}}, {"hyi", {"ひぃ"}}, {"hyu", {"ひゅ"}},
            {"hye", {"ひぇ"}}, {"hyo", {"ひょ"}}, {"fa", {"ふぁ"}},
            {"fi", {"ふぃ"}},  {"fu", {"ふ"}},    {"fe", {"ふぇ"}},
            {"fo", {"ふぉ"}},  {"fya", {"ふゃ"}}, {"fyi", {"ふぃ"}},
            {"fyu", {"ふゅ"}}, {"fye", {"ふぇ"}}, {"fyo", {"ふょ"}},
            {"ma", {"ま"}},    {"mi", {"み"}},    {"mu", {"む"}},
            {"me", {"め"}},    {"mo", {"も"}},    {"mya", {"みゃ"}},
            {"myu", {"みゅ"}}, {"mye", {"みぇ"}}, {"myo", {"みょ"}},
            {"ya", {"や"}},    {"yi", {"い"}},    {"yu", {"ゆ"}},
            {"ye", {"いぇ"}},  {"yo", {"よ"}},    {"ra", {"ら"}},
            {"ri", {"り"}},    {"ru", {"る"}},    {"re", {"れ"}},
            {"ro", {"ろ"}},    {"la", {"ら"}},    {"li", {"り"}},
            {"lu", {"る"}},    {"le", {"れ"}},    {"lo", {"ろ"}},
            {"rya", {"りゃ"}}, {"ryi", {"りぃ"}}, {"ryu", {"りゅ"}},
            {"rye", {"りぇ"}}, {"ryo", {"りょ"}}, {"lya", {"りゃ"}},
            {"lyi", {"りぃ"}}, {"lyu", {"りゅ"}}, {"lye", {"りぇ"}},
            {"lyo", {"りょ"}}, {"wa", {"わ"}},    {"wi", {"ゐ"}},
            {"wu", {"う"}},    {"we", {"ゑ"}},    {"wo", {"を"}},
            {"ga", {"が"}},    {"gi", {"ぎ"}},    {"gu", {"ぐ"}},
            {"ge", {"げ"}},    {"go", {"ご"}},    {"gya", {"ぎゃ"}},
            {"gyi", {"ぎぃ"}}, {"gyu", {"ぎゅ"}}, {"gye", {"ぎぇ"}},
            {"gyo", {"ぎょ"}}, {"za", {"ざ"}},    {"zi", {"じ"}},
            {"zu", {"ず"}},    {"ze", {"ぜ"}},    {"zo", {"ぞ"}},
            {"zya", {"じゃ"}}, {"zyi", {"じぃ"}}, {"zyu", {"じゅ"}},
            {"zye", {"じぇ"}}, {"zyo", {"じょ"}}, {"ja", {"じゃ"}},
            {"ji", {"じ"}},    {"ju", {"じゅ"}},  {"je", {"じぇ"}},
            {"jo", {"じょ"}},  {"da", {"だ"}},    {"di", {"ぢ"}},
            {"du", {"づ"}},    {"de", {"で"}},    {"do", {"ど"}},
            {"dya", {"ぢゃ"}}, {"dyi", {"でぃ"}}, {"dyu", {"ぢゅ"}},
            {"dye", {"ぢぇ"}}, {"dyo", {"ぢょ"}}, {"dha", {"でゃ"}},
            {"dhi", {"でぃ"}}, {"dhu", {"でゅ"}}, {"dhe", {"でぇ"}},
            {"dho", {"でょ"}}, {"ba", {"ば"}},    {"bi", {"び"}},
            {"bu", {"ぶ"}},    {"be", {"べ"}},    {"bo", {"ぼ"}},
            {"bya", {"びゃ"}}, {"byi", {"びゅ"}}, {"byu", {"びゅ"}},
            {"bye", {"びぇ"}}, {"byo", {"びょ"}}, {"pa", {"ぱ"}},
            {"pi", {"ぴ"}},    {"pu", {"ぷ"}},    {"pe", {"ぺ"}},
            {"po", {"ぽ"}},    {"pya", {"ぴゃ"}}, {"pyi", {"ぴぃ"}},
            {"pyu", {"ぴゅ"}}, {"pye", {"ぴぇ"}}, {"pyo", {"ぴょ"}},
            {"va", {"ヴぁ"}},  {"vi", {"ヴぃ"}},  {"vu", {"ヴ"}},
            {"ve", {"ヴぇ"}},  {"vo", {"ヴぉ"}},  {"kwa", {"くゎ"}},
            {"kwi", {"くぃ"}}, {"kwu", {"く"}},   {"kwe", {"くぇ"}},
            {"kwo", {"くぉ"}}, {"gwa", {"ぐゎ"}}, {"gwi", {"ぐぃ"}},
            {"gwu", {"ぐ"}},   {"gwe", {"ぐぇ"}}, {"gwo", {"ぐぉ"}},
            {"tsa", {"つぁ"}}, {"tsi", {"つぃ"}}, {"tse", {"つぇ"}},
            {"tso", {"つぉ"}}, {"n", {"ん"}},     {"n'", {"ん"}},
            {"nn", {"ん"}},    {"xa", {"ぁ"}},    {"xi", {"ぃ"}},
            {"xu", {"ぅ"}},    {"xe", {"ぇ"}},    {"xo", {"ぉ"}},
            {"xya", {"ゃ"}},   {"xyu", {"ゅ"}},   {"xyo", {"ょ"}},
            {"xtu", {"っ"}},   {"xwa", {"ゎ"}},   {"xti", {"てぃ"}},
            {"xdi", {"でぃ"}}, {"xdu", {"どぅ"}}, {"xde", {"でぇ"}},
            {"xdo", {"どぉ"}}, {"xwi", {"うぃ"}}, {"xwe", {"うぇ"}},
            {"xwo", {"うぉ"}},
        };
    FCITX_ASSERT(expectedValues.size() == keys->size());
    for (size_t i = 0; i < keys->size(); i++) {
        FCITX_ASSERT((*keys)[i] == std::get<0>(expectedValues[i]))
            << (*keys)[i] << " " << expectedValues[i];
        auto values = style.getStringArray(section, (*keys)[i]);
        FCITX_ASSERT(values);
        FCITX_ASSERT(*values == std::get<1>(expectedValues[i]));
    }
}

} // namespace

int main() {
    test101kana();
    testwnn();

    return 0;
}
