Repository: fcitx/fcitx5-anthy
Catalog: po/*.po
Languages: fr

source: Add Word
fr: Ajouter un mot

source: Add word
fr: Ajouter un mot

source: Allow split
fr: Permettre la division

source: Anthy for Fcitx 5
fr: Anthy pour Fcitx 5

source: Behavior on a comma or a period
fr: Comportement avec une virgule ou un point

source: Cancel
fr: Annuler

source: Cancel all
fr: Tout annuler

source: Cancel pseudo ascii mode
fr: Annuler le mode pseudo-ASCII

source: Candidate List Layout
fr: Disposition de la liste de propositions

source: Candidates Page Down
fr: Page bas propositions

source: Candidates Page Up
fr: Page haut propositions

source: Circle input mode
fr: Méthode de saisie Circle

source: Circle kana mode
fr: Mode kana de Circle

source: Circle latin and hiragana mode
fr: Mode latin et hiragana de Circle

source: Circle typing method
fr: Méthode de frappe de Circle

source: Command
fr: Commande

source: Commit
fr: Valider

source: Commit Reverse Learn
fr: Apprentissage inverse lors de la validation

source: Commit first segement reverse learn
fr: Apprentissage inverse lors de la validation du premier segment

source: Commit first segment
fr: Valider le premier segment

source: Commit selected segement reverse learn
fr: Apprentissage inverse lors de la validation du segment sélectionné

source: Commit selected segment
fr: Valider le segment sélectionné

source: Conversion mode
fr: Mode conversion

source: Convert
fr: Convertir

source: Convert To Half
fr: Convertir vers demi

source: Convert To Half Katakana
fr: Convertir vers demi katakana

source: Convert To Hiragana
fr: Convertir vers hiragana

source: Convert To Katakana
fr: Convertir vers katakana

source: Convert To Latin
fr: Convertir vers latin

source: Convert To Wide Latin
fr: Convertir vers latin large

source: Convert as you type (Multi segment)
fr: Convertir durant la frappe (multi-segment)

source: Convert as you type (Single segment)
fr: Convertir durant la frappe (segment unique)

source: Convert char type backward
fr: Convertir le type de caractère en arrière

source: Convert char type forward
fr: Convertir le type de caractère en avant

source: Custom
fr: Personnalisé

source: Custom Kana Table
fr: Table kana personnalisée

source: Default
fr: Par défaut

source: Delete
fr: Supprimer

source: Dict admin
fr: Admin de dict

source: Direct input
fr: Saisie directe

source: Entering the pseudo ASCII input mode with capital letters
fr: Entrer dans le mode de saisie pseudo ASCII avec des lettres capitales

source: Expand segment
fr: Étendre le segment

source: General
fr: Général

source: Half
fr: Demi

source: Half Katakana
fr: Demi-katakana

source: Half Katakana mode
fr: Mode demi-katakana

source: Half width katakana
fr: Katakana demi-largeur

source: Hiragana mode
fr: Mode hiragana

source: Initial Input mode
fr: Mode de saisie initial

source: Insert Alternative space
fr: Insérer un espace alternatif

source: Insert Half Space
fr: Insérer un demi-espace

source: Insert space
fr: Insérer un espace

source: Insert wide space
fr: Insérer un espace large

source: Japanese
fr: Japonais

source: Japanese input method based on Anthy
fr: Méthode de saisie du japonais basé sur Anthy

source: Kana Table
fr: Table kana

source: Katakana mode
fr: Mode katakana

source: Key
fr: Touche

source: Key Profile
fr: Profil de touche

source: Key binding profile
fr: Profil d'assignation des touches

source: Latin mode
fr: Mode latin

source: Learn on auto commit
fr: Apprentissage pendant la validation automatique

source: Learn on manual commit
fr: Apprentissage pendant la validation manuelle

source: Multi segment
fr: Mutli-segment

source: Multi segment immediate
fr: Multi-segment immédiat

source: Nicola Table
fr: Table Nicola

source: None
fr: Aucun

source: Not Set
fr: Non définit

source: Page size
fr: Taille de page

source: Period style
fr: Style de point

source: Predict
fr: Prédire

source: Predict on input
fr: Prédire durant la saisie

source: Reconvert
fr: Reconvertir

source: Ro key for kana layout
fr: Touche Ro pour la disposition kana

source: Romaji
fr: Rōmaji

source: Romaji Table
fr: Table rōmaji

source: Select first candidate
fr: Sélectionner la première proposition

source: Select first segment
fr: Sélectionner le premier segment

source: Select last candidate
fr: Sélectionner la dernière proposition

source: Select last segment
fr: Sélectionner le dernier segment

source: Select next candidate
fr: Sélectionner la proposition suivante

source: Select next segment
fr: Sélectionner le segment suivant

source: Select prev candidate
fr: Sélectionner la proposition précédente

source: Select prev segment
fr: Sélectionner le segment précédent

source: Show candidates label
fr: Montrer le label de la proposition

source: Show conversion mode
fr: Afficher le mode de conversion

source: Show input mode
fr: Afficher le mode de saisie

source: Show symbol style
fr: Afficher le style de symbole

source: Show typing method
fr: Afficher la méthode de saisie

source: Shrink segment
fr: Compresser le segment

source: Single segment
fr: Segment unique

source: Single segment immediate
fr: Segment unique immédiat

source: Space type
fr: Type d'espace

source: Symbol style
fr: Type de symbole

source: Typing method
fr: Méthode de frappe

source: Use direct key on predict
fr: Utiliser la touche directement lors d'une prédiction

source: Use half-width characters for numbers
fr: Utiliser des caractères demi-largeur pour les chiffres

source: Use half-width characters for symbols
fr: Utiliser des caractères demi-largeur pour les symboles

source: Wide
fr: Large

source: Wide Latin
fr: Latin large

source: Wide latin
fr: Latin large

source: Wide latin Japanese
fr: Japonais latin large

source: Wide latin mode
fr: Mode latin large
